Revit 2027 API
ViewDisplayDepthCueing.EnableDepthCueing Property
 True to enable depth cueing. False to disable it.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool EnableDepthCueing { get; set; }
Public Property EnableDepthCueing As Boolean
	Get
	Set
public:
property bool EnableDepthCueing {
	bool get ();
	void set (bool value);
}
member EnableDepthCueing : bool with get, set
Property Value
Boolean
See Also
Reference
ViewDisplayDepthCueing Class
Autodesk.Revit.DB Namespace